_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d (Conv2D)              (None, 13, 26, 32)        320
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 11, 24, 32)        9248
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 5, 12, 32)         0
_________________________________________________________________
dropout (Dropout)            (None, 5, 12, 32)         0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 5, 12, 64)         18496
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 3, 10, 64)         36928
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 1, 5, 64)          0
_________________________________________________________________
dropout_1 (Dropout)          (None, 1, 5, 64)          0
_________________________________________________________________
flatten (Flatten)            (None, 320)               0
_________________________________________________________________
dense (Dense)                (None, 512)               164352
_________________________________________________________________
dropout_2 (Dropout)          (None, 512)               0
_________________________________________________________________
dense_1 (Dense)              (None, 8)                 4104
=================================================================
Total params: 233,448
Trainable params: 233,448
Non-trainable params: 0
_________________________________________________________________